cmsis-svd/cmsis-svd/data/HDSC/HC32F146FX.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>OPA0</name>
            <description>desc OPA</description>
            <baseAddress>0x4003C400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1</size>
            </addressBlock>
            <registers>
                <register>
                    <name>OPA_CTL</name>
                    <description>desc OPA_CTL</description>
                    <addressOffset>0x0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>OPA_EN</name>
                            <description>desc OPA_EN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="OPA0">
            <name>OPA1</name>
            <description>desc OPA</description>
            <baseAddress>0x4003C480</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1</size>
            </addressBlock>
        </peripheral>
        <peripheral>
            <name>OSC_CTL</name>
            <description>desc OSC_CTL</description>
            <baseAddress>0x4002E000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x34</size>
            </addressBlock>
            <registers>
                <register>
                    <name>HICR_TRMKEY</name>
                    <description>desc HICR_TRMKEY</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TRMKEY</name>
                            <description>desc TRMKEY</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HICR_FTRM</name>
                    <description>desc HICR_FTRM</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x64</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>CR4MFTRM</name>
                            <description>desc CR4MFTRM</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HICR_TTRM</name>
                    <description>desc HICR_TTRM</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x5</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>CR4MTTRM</name>
                            <description>desc CR4MTTRM</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HICR_FDIV</name>
                    <description>desc HICR_FDIV</description>
                    <addressOffset>0x10</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>FDIV</name>
                            <description>desc FDIV</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HSXT_PWRCTL</name>
                    <description>desc HSXT_PWRCTL</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x30003</resetMask>
                    <fields>
                        <field>
                            <name>HXSEL</name>
                            <description>desc HXSEL</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HIBS</name>
                            <description>desc HIBS</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LSXT_PWRCTL</name>
                    <description>desc LSXT_PWRCTL</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x30000</resetValue>
                    <resetMask>0x70000</resetMask>
                    <fields>
                        <field>
                            <name>LIBS</name>
                            <description>desc LIBS</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
